#该模块储存所有脱单人员的信息,通过检测查找信心进行反馈
#但是该模块存在一个很严重的问题:不能进行无缝修改,即必须关闭服务器程序进行修改
#后续尝试运用读取文档的方式进行服务
import sys
import os
import random


qishu_dict = {
          '1':{
               'title':'这里有个心仪的TA--等你脱单第一期~~',
               'description':'等你脱单1期~~',
               'img':'http://kan.027cgb.com/623324/177048046.jpg',
               'url':'https://mp.weixin.qq.com/s/WkHUWEvdC0e29zQaUD4R7g'},
        '415':{
               'title':'等你脱单第415期~~',
               'description':'等你脱单第415期~~',
               'img':'http://kan.027cgb.com/623324/177048046.jpg',
               'url':'https://mp.weixin.qq.com/s/deDiW5nubnQv_Dk2F05IlQ'},
        '416':{
               'title':'等你脱单第416期~~',
               'description':'等你脱单第416期~~',
               'img':'http://kan.027cgb.com/623324/177048046.jpg',
               'url':'https://mp.weixin.qq.com/s/fVcpYE4QMYmqqMCaD_lYPA'},
         '417':{
               'title':'等你脱单第417期~~',
               'description':'等你脱单第417期~~',
               'img':'http://kan.027cgb.com/623324/177048046.jpg',
               'url':'https://mp.weixin.qq.com/s/bIvzDQdSyTAr3cSrQcvuBg'},
         '419':{
             'title':'等你脱单第419期~~',
               'description':'等你脱单第419期~~',
               'img':'http://kan.027cgb.com/623324/177048046.jpg',
               'url':'https://mp.weixin.qq.com/s/0PCml7miR0UQWIZzHnyHbA'},
         '420':{
               'title':'等你脱单第420期~~',
               'description':'等你脱单第420期~~',
               'img':'http://kan.027cgb.com/623324/177048046.jpg',
               'url':'https://mp.weixin.qq.com/s/8S0fX_DGPZ2fISEvySnnEw'},
         '421':{
               'title':'等你脱单第421期~~',
               'description':'等你脱单第421期~~',
               'img':'http://kan.027cgb.com/623324/177048046.jpg',
               'url':'https://mp.weixin.qq.com/s/88igLVBjE6QPiRMz5hKuwQ'},
         '422':{
               'title':'等你脱单第422期~~',
               'description':'等你脱单第422期~~',
               'img':'http://kan.027cgb.com/623324/177048046.jpg',
               'url':'https://mp.weixin.qq.com/s/KGGr-v8b0LuDhkAPk1XqCg'},
         '423':{
               'title':'等你脱单第423期~~',
               'description':'等你脱单第423期~~',
               'img':'http://kan.027cgb.com/623324/177048046.jpg',
               'url':'https://mp.weixin.qq.com/s/FD1vi8ei9R2BrOQTQWw0fQ'},
         '424':{
               'title':'等你脱单第424期~~',
               'description':'等你脱单第424期~~',
               'img':'http://kan.027cgb.com/623324/177048046.jpg',
               'url':'https://mp.weixin.qq.com/s/IHfvgvBqc4ddtAMk4VZlJw'},
         '425':{
               'title':'等你脱单第425期~~',
               'description':'等你脱单第425期~~',
               'img':'http://kan.027cgb.com/623324/177048046.jpg',
               'url':'https://mp.weixin.qq.com/s/XZEAXgn5_07XzSlOkEx4TQ'}

}




#里面添加所有人的资料,可以选择性的添加信息,主要是期数信息和联系方式
#data = {
#    '415-1':'位置:415-1\n呢称46:\n年龄:93年的\n身高172:\n星座:不知道\n学校:中国科学技术大学\n年级:17级硕士\n专业:软件\n故乡:河北省衡水市',
#    '415-2':'位置:415-2\n呢称:他C哥\n年龄:25\n身高:183\n星座:射手座\n学校:大连理工大学\n年级:研三\n专业:船舶与海洋工程\n故乡:辽宁省盘锦市',
#    '415-4':'位置:415-3\n呢称:大粥冷\n年龄:24\n身高:175\n星座:双鱼座\n学校:大连理工大学\n年级:研三\n专业:船舶与海洋工程\n故乡:湖南省岳阳',
#    '415-3':'位置:415-4\n呢称:start\n年龄:25\n身高:178\n星座:金牛座\n学校:大连理工大学\n年级:研三\n专业:船舶与海洋工程\n故乡:安徽省',
#    '415-5':'位置:415-5\n呢称:胡高源\n年龄:25\n身高:182\n星座:狮子座\n学校:大连理工大学\n年级:研三\n专业:船舶与海洋工程\n故乡:河南漯河',
#    '415-6':'位置:415-6\n呢称:Pt\n年龄:29\n身高:173\n星座:天蝎座\n学校:大连理工大学\n年级:博三\n专业:控制理论与控制工程\n故乡:吉林省',
#    '416-1':'位置:416-1\n呢称:小麋\n年龄:24\n身高:170\n星座:双子座\n学校:辽宁师范大学\n年级:研二\n专业:教育\n故乡:山东省',
#    '416-2':'位置:416-2\n呢称:周淳朴\n年龄:26\n身高:172\n星座:天秤座\n学校:大连理工大学\n年级:毕业一年\n专业:控制理论与控制工程\n故乡:辽宁省大连市',
#    '416-3':'位置:416-3\n呢称:Z\n年龄:26\n身高:181\n星座:双子座\n学校:大连理工大学\n年级:研三\n专业:c船舶与海洋工程\n故乡:河南周口',
#    '416-4':'位置:416-4\n呢称:啄木鸟\n年龄:32\n身高:160\n星座:处女座\n学校:大连理工大学\n年级:MBA在读\n专业:IMBA\n故乡:黑龙江省哈尔滨市',
#    '416-5':'位置:416-5\n此女神已被丘比特封存~~',
#    '416-6':'位置:416-6\n呢称:chris\n年龄:24\n身高:186\n星座:双鱼座\n学校:大连理工大学\n年级:研一\n专业:运载工程与力学学部\n故乡:哈尔滨',
#    '417-1':'位置:417-1\n呢称:白茶\n年龄:23\n身高:168\n星座:天蝎座\n学校:大连理工大学\n年级:研一\n专业:控制工程\n故乡:山东省',
#    '417-2':'位置:417-2\n呢称:Vap\n年龄:21\n身高:176\n星座:双鱼座\n学校:山东财经大学\n年级:大四\n专业:金融数学\n故乡:山东省烟台市',
#    '417-3':'位置:417-3\n呢称:甜果果\n年龄:26\n身高:183\n星座:处女座\n学校:大连海事大学\n年级:研二\n专业:管科\n故乡:吉林省长春市',
#    '417-4':'位置:417-4\n呢称:高晗钰\n年龄:25\n身高:173\n星座:双子座\n学校:大连海事大学\n年级:研三\n专业:轮机工程\n故乡:湖南省永州市',
#    '417-5':'位置:417-5\n呢称:晨鹅\n年龄:20\n身高:168\n星座:巨蟹座\n学校:宁波诺丁汉大学\n年级:大二\n专业:金融财务与管理\n故乡:浙江省宁波市',
#    '417-6':'位置:417-6\n呢称:杨楠\n年龄:27\n身高:160\n星座:摩羯座\n学校:辽东大学\n年级:毕业三年\n专业:测控技术与仪器\n故乡:辽宁省大连市',
#    '419-1':'位置:419-1\n呢称:耿思佳\n年龄:25\n身高:155\n星座:双鱼座\n学校:东北师范大学\n年级:毕业一年\n专业:物理\n故乡:辽宁大连',
#    '419-2':'位置:419-2\n呢称:张维\n年龄:28\n身高:175\n星座:水瓶座\n学校:同济大学\n年级:略\n专业:准MBA\n故乡:辽宁大连',
#    '419-3':'位置:419-3\n呢称:子弹\n年龄:23\n身高:163\n星座:摩羯座\n学校:大连交通大学\n年级:大四\n专业:软件工程\n故乡:辽宁省沈阳',
#    '419-4':'位置:419-4\n呢称:冰封\n年龄:26\n身高:165\n星座:摩羯座\n学校:沈阳航空航天大学\n年级:毕业三年\n专业:电子商务\n故乡:辽宁省铁岭市',
#    '419-5':'位置:419-5\n呢称:王伟\n年龄:22\n身高:181\n星座:狮子座\n学校:大连海事大学\n年级:研一\n专业:交通工程\n故乡:甘肃省白银市',
#    '419-6':'位置:419-6\n呢称:明天\n年龄:25\n身高:173\n星座:处女座\n学校:大连理工大学\n年级:研一\n专业:控制工程\n故乡:辽宁朝阳',
#    '420-1':'位置:420-1\n呢称:小柿子\n年龄:23\n身高:163\n星座:天蝎座\n学校:大连海事大学\n年级:研一\n专业:工业工程\n故乡:辽宁锦州',
#    '420-2':'位置:420-2\n呢称:刘峰\n年龄:21\n身高:172\n星座:处女座\n学校:大连理工大学\n年级:研一\n专业:电器工程\n故乡:贵州省六盘水',
#    '420-3':'位置:420-3\n呢称:谢小笨\n年龄:24\n身高:163\n星座:白羊座\n学校:大连理工大学城市学院\n年级:毕业两年\n专业:物流\n故乡:辽宁沈阳',
#    '420-4':'位置:420-4\n呢称:一心工作赚钱的90后\n年龄:25\n身高:174\n星座:水瓶座\n学校:大连财经\n年级毕业:\n专业:财务管理\n故乡:辽宁省大连市',
#    '420-5':'位置:420-5\n呢称:传说我来造\n年龄:26\n身高:178\n星座:狮子座\n学校:大连海事大学\n年级:研一\n专业:电子科学与技术\n故乡:吉林省白山市',
#    '420-6':'位置:420-6\n呢称:巴赫的黑键\n年龄:24\n身高:188\n星座:双子座\n学校:大连海事大学\n年级:大二\n专业:法学\n故乡:河南省周口市',
#    '421-1':'位置:421-1\n呢称:小咕哩嘎\n年龄:24\n身高:162\n星座:摩羯座\n学校:辽宁师范大学\n年级:研二\n专业:作曲\n故乡:黑龙江伊春',
#    '421-2':'位置:421-2\n呢称:白嫩小胖\n年龄:20\n身高:160\n星座:处女座\n学校:辽宁师范大学\n年级:大二\n专业:计算机科学与技术\n故乡:河南商丘',
#    '421-3':'位置:421-3\n呢称:常国月（长佳晓月）\n年龄:23\n身高:158\n星座:狮子座\n学校:辽宁师范大学\n年级:大四\n专业:汉语国际教育(师范)\n故乡:辽宁省朝阳县',
#    '421-4':'位置:421-4\n呢称:惟适之安\n年龄:29\n身高:165\n星座:金牛座\n学校:大连理工大学\n年级:毕业一年\n专业:工商管理\n故乡:湖南益阳',
#    '421-5':'位置:421-5\n呢称:王路\n年龄:22\n身高:181\n星座:摩羯座\n学校:大连海事大学\n年级:大四\n专业:国际经济法\n故乡:河南信阳',
#    '421-6':'位置:421-6\n呢称:在水一方\n年龄:28\n身高:180\n星座:天秤座\n学校:大连海事大学\n年级:研三\n专业:控制科学与工程\n故乡:辽宁省朝阳',
#    '422-1':'位置:422-1\n呢称:浅笑安然\n年龄:25\n身高:165\n星座:摩羯座\n学校:辽宁省师范大学\n年级:研一\n专业:化学\n故乡:辽宁省锦州市',
#    '422-2':'位置:422-2\n呢称:sp\n年龄:29\n身高:180\n星座:天蝎座\n学校:大连医科大学\n年级:毕业三年\n专业:口腔医学\n故乡:山东省',
#    '422-3':'位置:422-3\n呢称:曹冯\n年龄:19\n身高:165\n星座:天蝎座\n学校:大连理工大学\n年级:大一\n专业:应用化学\n故乡:江西省九江市',
#    '422-4':'位置:422-4\n呢称:常盛杰\n年龄:27\n身高:175\n星座:处女座\n学校:兰州交通大学\n年级:硕士毕业一年\n专业:计算机技术\n故乡:辽宁省沈阳市',
#    '422-5':'位置:422-5\n呢称:冰晨儿\n年龄:22\n身高:168\n星座:水瓶座\n学校:辽宁师范大学\n年级:大三\n专业:音乐表演\n故乡:辽宁省大连市',
#    'T001-1':'位置:T001-1\n呢称:小兵兵\n年龄:26\n身高:178\n星座:处女座\n学校:大连理工大学\n年级:准博一\n专业:机械\n故乡:辽宁省大连市',
#    '423-1':'位置:423-1\n呢称:˙Ꙫ˙\n年龄:19\n身高:164\n星座:金牛座\n学校:衡阳师范学院\n年级:大一\n专业:思想政治教育\n故乡:辽宁省阜新市',
#    '423-2':'位置:423-2\n呢称:韩一帅\n年龄:23\n身高:176\n星座:处女座\n学校:辽宁警察学院\n年级:大三\n专业:治安\n故乡:辽宁省大连市',
#    '423-3':'位置:423-3\n呢称:我心微风起\n年龄:24\n身高:174\n星座:不知道\n学校:大连理工大学\n年级:研二\n专业:电气工程\n故乡:辽宁省鞍山市',
#    '423-4':'位置:423-4\n呢称:sing.致颂\n年龄:20\n身高:183\n星座:狮子座\n学校:东北林业大学\n年级:大一\n专业:土木工程专业\n故乡:辽宁省庄河市',
#    '423-5':'位置:423-5\n呢称:苏格拉鹏\n年龄:24\n身高:170\n星座:摩羯座\n学校:武汉大学\n年级:研三\n专业:自动化\n故乡:河南省平顶山',
#    '423-6':'位置:423-6\n呢称:楽\n年龄:22\n身高:182\n星座:金牛\n学校:辽宁师范大学\n年级:大四\n专业:体育学院\n故乡:辽宁省大连市',
#    '424-1':'位置:424-1\n呢称:哥想不出什么呢称\n年龄:25\n身高:179\n星座:巨蟹座\n学校:大连理工大学\n年级:研一\n专业:车辆工程\n故乡:辽宁省大连市',
#    '424-2':'位置:424-2\n此男神已被丘比特封存~~',
#    '424-3':'位置:424-3\n呢称:Mr L\n年龄:24\n身高:170\n星座:摩羯座\n学校:大连理工大学\n年级:毕业一年\n专业:化工与制药\n故乡:河北省邯郸市',
#    '424-4':'位置:424-4\n呢称:mamba out\n年龄:22\n身高:180\n星座:天秤座\n学校:辽宁师范大学\n年级:大三\n专业:体育学院\n故乡:辽宁省大连市',
#    '424-5':'位置:424-5\n此男神已被丘比特封存~~',
#    '424-6':'位置:424-6\n呢称:李一鸣\n年龄:22\n身高:178\n星座:处女座\n学校:大连理工大学\n年级:大四\n专业:材料\n故乡:辽宁省鞍山市',
#    '425-1':'位置:425-1\n呢称:游路宽\n年龄:23\n身高:177\n星座:摩羯座\n学校:大连交通大学\n年级:大四\n专业:车辆工程\n故乡:吉林省临江市',
#    '425-2':'位置:425-2\n呢称:张友敏\n年龄:25\n身高:165\n星座:巨蟹座\n学校:北京航空航天大学\n年级:研二\n专业:计算机科学与技术\n故乡:江西吉安',
#    '425-3':'位置:425-3\n呢称:焦爱\n年龄:22\n身高:163\n星座:双子座\n学校:大连外国语大学\n年级:毕业一年\n专业:日语高级翻译\n故乡:辽宁省沈阳市',
#    '425-4':'位置:425-4\n呢称:贺明宇\n年龄:22\n身高:178\n星座:巨蟹座\n学校:大连海事大学\n年级:大四\n专业:航海技术\n故乡:辽宁省大连市',
#    '425-5':'位置:425-5\n呢称:Hober\n年龄:21\n身高:183\n星座:巨蟹座\n学校:辽宁师范大学\n年级:大二\n专业:美术学\n故乡:辽宁省大连市' 
#    }


################################################################################################################################################
data = {
    '415-1':'位置:415-1',
    '415-2':'位置:415-2',
    '415-4':'位置:415-3',
    '415-3':'位置:415-4',
    '415-5':'位置:415-5',
    '415-6':'位置:415-6',
    '416-1':'位置:416-1',
    '416-2':'位置:416-2',
    '416-3':'位置:416-3',
    '416-4':'位置:416-4',
    '416-5':'位置:416-5',
    '416-6':'位置:416-6',
    '417-1':'位置:417-1',
    '417-2':'位置:417-2',
    '417-3':'位置:417-3',
    '417-4':'位置:417-4',
    '417-5':'位置:417-5',
    '417-6':'位置:417-6',
    '419-1':'位置:419-1',
    '419-2':'位置:419-2',
    '419-3':'位置:419-3',
    '419-4':'位置:419-4',
    '419-5':'位置:419-5',
    '419-6':'位置:419-6',
    '420-1':'位置:420-1',
    '420-2':'位置:420-2',
    '420-3':'位置:420-3',
    '420-4':'位置:420-4',
    '420-5':'位置:420-5',
    '420-6':'位置:420-6',
    '421-1':'位置:421-1',
    '421-2':'位置:421-2',
    '421-3':'位置:421-3',
    '421-4':'位置:421-4',
    '421-5':'位置:421-5',
    '421-6':'位置:421-6',
    '422-1':'位置:422-1',
    '422-2':'位置:422-2',
    '422-3':'位置:422-3',
    '422-4':'位置:422-4',
    '422-5':'位置:422-5',
    'T001-1':'位置:T001-1',
    '423-1':'位置:423-1',
    '423-2':'位置:423-2',
    '423-3':'位置:423-3',
    '423-4':'位置:423-4',
    '423-5':'位置:423-5',
    '423-6':'位置:423-6',
    '424-1':'位置:424-1',
    '424-2':'位置:424-2',
    '424-3':'位置:424-3',
    '424-4':'位置:424-4',
    '424-5':'位置:424-5',
    '424-6':'位置:424-6',
    '425-1':'位置:425-1',
    '425-2':'位置:425-2',
    '425-3':'位置:425-3',
    '425-4':'位置:425-4',
    '425-5':'位置:425-5'
    }



########################################################################################
#根据人员工作地点区分
people_tuodan_place = {
        '河北省':['415-1','424-3'],
        '辽宁省':['415-2','419-2','419-3','419-4','416-2','417-6','419-1','419-6','420-1','420-3','420-4','421-2','421-3','421-6','422-1','422-4','422-5','T001-1','423-1','423-2','423-3','423-4','423-6','424-1','424-4','424-5','424-6','425-3','425-4','425-5'],
        '安徽省':['415-3'],
        '湖南省':['415-4','417-4','421-4'],
        '河南省':['415-5','421-5','423-5'],
        '吉林省':['415-6','417-3','424-2','425-1'],
        '山东省':['416-1','417-1','417-2','420-5','422-2'],
        '河南省':['416-3','420-6'],
        '黑龙江省':['416-4','416-6','421-1'],
        '浙江省':['417-5'],
        '甘肃省':['419-5'],
        '贵州省':['420-2'],
        '江西省':['422-3','425-2']
        
}

#根据专业区分
people_tuodan_zhuanye = {
        '文学':['416-1','425-3'],
        '工学':['415-1','415-2','415-3','415-4','415-5','415-6','416-2','416-3','416-6','417-1','417-4','417-6','419-3','419-4','419-5','419-6','420-1','420-2','420-5','421-2','421-6','422-3','422-4','T001-1','423-3','423-4','423-5','424-1','424-2','424-3','424-5','424-6','425-1','425-2','425-4'],
        '艺术':['421-1','422-5','425-5'],
        '医学':['422-2'],
        '理学':['417-2','417-3','417-5','419-1','422-1'],
        'MBA':['416-4','419-2'],
        '管理学':['420-3','420-4','421-4'],
        '经济学':[],
        '教育学':['421-3','423-1','423-6','424-4'],
        '法学':['420-6','421-5'],
        '军事学':['423-2']
}

#根据星座区分
people_tuodan_xingzuo = {
        '摩羯座':['417-6','419-3','419-4','421-1','421-5','422-1','423-5','424-2','424-3','425-1'],
        '天秤座':['416-2','421-6','424-4'],
        '水瓶座':['419-2','420-4','422-5'],
        '天蝎座':['415-6','417-1','420-1','422-2','422-3'],
        '狮子座':['415-5','419-5','420-5','421-3','423-4'],
        '处女座':['416-4','417-3','419-6','420-2','421-2','422-4','T001-1','423-2','424-6'],
        '金牛座':['415-3','421-4','423-1','423-6'],
        '白羊座':['420-3'],
        '巨蟹座':['417-5','424-1','425-2','425-4','425-5'],
        '双鱼座':['415-4','416-6','417-2','419-1','424-5'],
        '射手座':['415-2'],
        '双子座':['416-1','416-3','417-4','420-6','425-3'],
        '不知道':['415-1']
}

#根据大学生,硕士,博士区分  MBA不知道怎么分类416-4,毕业的不知道怎么弄416-3
people_tuodan_xuewei = {
        '学士':['417-2','417-5','419-3','420-6','421-2','421-3','421-5','422-3','422-5','423-1','423-2','423-4','423-6','424-4','424-6','425-4','425-5'],
        '硕士':['415-1','415-2','415-3','415-4','415-5','416-1','416-3','416-4','417-1','417-3','417-4','419-5','419-6','420-1','420-2','420-5','421-1','421-6','422-1','423-3','423-5','424-1','424-2','424-5','425-1','425-2'],
        '博士':['415-6','T001-1']
        
        }

#根据性别区分
people_tuodan_xingbie = {
        '男':['415-1','415-2','415-3','415-4','415-5','415-6','416-3','416-6','417-2','417-3','417-4','419-2','419-5','419-6','420-2','420-5','420-6','421-4','421-5','421-6','422-2','422-4','423-2','423-3','423-4','423-5','423-6','424-1','424-2','424-3','424-4','424-5','424-6','425-1','425-2','425-4','425-5'],
        '女':['416-1','416-2','416-4','417-1','417-5','417-6','419-1','419-3','419-4','420-1','420-3','420-4','421-1','421-2','421-3','422-1','422-3','422-5','423-1','425-3']
        }
##########################################################################################


#目前支持的查找属性
list_can = ['学位','专业','地点','星座','性别']

#推送符合查找条件的人员给用户,为了防止数量太多导致消息回复出错,目前最多随机回复5条信息
def check_message(input_):
    len_input = len(input_)
    input_shuxing = input_[0:2]#可能是工作地点,故乡
    res = ''
    if input_shuxing == '地点':
        job_place = input_[2:len_input]#提取工作地点名称
        if job_place not in people_tuodan_place.keys():
            res = '目前不存在该区域的同学报名哦(目前仅支持省份查找,请按照"地点辽宁省"进行输入)~~'
            return res
        len_job_place = len(people_tuodan_place[job_place])
        if len_job_place <= 5:#如果发现符合条件的期数数量大于5,则随机回复5条数据即可
            for i in range(len_job_place):
                ans = people_tuodan_place[job_place][i]
                res = data[ans] + '\n' + res
            return '回复对应的期数查看详情哦\n' + '\n' + res
        else:
            random_list = random.sample(people_tuodan_place[job_place],5)#随机取5个值
            for i in range(5):
                ans = random_list[i]
                res = data[ans] + '\n' + res
            return '回复对应期数查看详情哦\n' + '\n' + '由于人数过多,昵昵随机选择了5个~~\n' + res
    elif input_shuxing == '学位':
        job_xuewei = input_[2:len_input]
        if job_xuewei not in people_tuodan_xuewei.keys():
            res = '该学位不存在哦(请按照"学位博士"进行输入)~~'
            return res
        len_job_xuewei = len(people_tuodan_xuewei[job_xuewei])
        if len_job_xuewei <= 5:            
            for i in range(len_job_xuewei):
                ans = people_tuodan_xuewei[job_xuewei][i]
                res = data[ans] + '\n' + res
            return '回复对应的期数查看详情哦\n' + '\n' + res
        else:
            random_list = random.sample(people_tuodan_xuewei[job_xuewei],5)
            for  i in range(5):
                ans = random_list[i]
                res = data[ans] + '\n' + res
            return '回复对应期数查看详情哦\n' + '\n' + '由于人数过多,昵昵随机选择了5个~~\n' + res
    elif input_shuxing == '专业':
        job_zhuanye = input_[2:len_input]
        if job_zhuanye not in people_tuodan_zhuanye.keys():
            res = '该专业不存在哦(请按照"专业工学"进行输入)~~'
            return res
        len_job_zhuanye = len(people_tuodan_zhuanye[job_zhuanye])
        if len_job_zhuanye <= 5:
            for i in range(len_job_zhuanye):
                ans = people_tuodan_zhuanye[job_zhuanye][i]
                res = data[ans] + '\n' + res
            return '回复对应的期数查看详情哦\n' + '\n' + res
        else:
            random_list = random.sample(people_tuodan_zhuanye[job_zhuanye],5)
            for  i in range(5):
                ans = random_list[i]
                res = data[ans] + '\n' + res
            return '回复对应期数查看详情哦\n' + '\n' + '由于人数过多,昵昵随机选择了5个~~\n' + res
    elif input_shuxing == '星座':
        job_xingzuo = input_[2:len_input]
        #print (job_xingzuo)
        if job_xingzuo not in people_tuodan_xingzuo.keys():
            res = '输入的星座不存在哦(请按照"星座摩羯座"进行输入)~~'
            return res
        len_job_xingzuo = len(people_tuodan_xingzuo[job_xingzuo])
        if len_job_xingzuo <= 5:
            for i in range(len_job_xingzuo):
                ans = people_tuodan_xingzuo[job_xingzuo][i]
                res = data[ans] + '\n' + res
            return '回复对应的期数查看详情哦\n' + '\n' + res
        else:
            random_list = random.sample(people_tuodan_xingzuo[job_xingzuo],5)
            for  i in range(5):
                ans = random_list[i]
                res = data[ans] + '\n' + res
            return '回复对应期数查看详情哦\n' + '\n' + '由于人数过多,昵昵随机选择了5个~~\n' + res
    elif input_shuxing == '性别':
        job_xingbie = input_[2:len_input]
        if job_xingbie not in people_tuodan_xingbie.keys():
            res = '输入的性别不存在哦(请按照"性别男"进行输入)~~'
            return res
        len_job_xingbie = len(people_tuodan_xingbie[job_xingbie])
        if len_job_xingbie <= 5:
            for i in range(len_job_xingbie):
                ans = people_tuodan_xingbie[job_xingbie][i]
                res = data[ans] + '\n' + res
            return '回复对应的期数查看详情哦\n' + '\n' + res
        else:
            random_list = random.sample(people_tuodan_xingbie[job_xingbie],5)
            for  i in range(5):
                ans = random_list[i]
                res = data[ans] + '\n' + res
            return '回复对应期数查看详情哦\n' + '\n' + '由于人数过多,昵昵随机选择了5个~~\n' + res

def get_message(input_):
    input_shuxing = input_[0:2]#可能是工作地点,故乡
    ans = check_message(input_shuxing)
    print (ans)
    
    
    
    #if input_shuxing not in list_can:
    #    return input_
    #else:
    #    ans = check_message(input_)
    #    return ans



if __name__ == '__main__':
    
    while True:
        str_ = input('请输入查找条件: ')
        ans = check_message(str_)
        print (ans)
